atom_type = ['None', 
    'H' , 'He', 'Li', 'Be', 'B' , 
    'C' , 'N' , 'O' , 'F' , 'Ne', 
    'Na', 'Mg', 'Al', 'Si', 'P' , 
    'S' , 'Cl', 'Ar', 'K' , 'Ca',
]

atom_mass_array = [0.,
  1.0079400, 4.002602,  6.94100000, 9.01218200, 10.811000,
  12.010700, 14.00670,  15.9994000, 18.9984032, 20.179700,
  22.989769, 24.30500,  26.9815386, 28.0855000, 30.973762,
  32.065000, 35.45300,  39.9480000, 39.0983000, 40.078000,
]

atom_mass_dict = {
    'H'  : 1.00794000,
    'He' : 4.00260200,
    'Li' : 6.94100000,
    'Be' : 9.01218200,
    'B'  : 10.8110000,
    'C'  : 12.0107000,
    'N'  : 14.0067000,
    'O'  : 15.9994000,
    'F'  : 18.9984032,
    'Ne' : 20.1797000,
    'Na' : 22.9897690,
    'Mg' : 24.3050000,
    'Al' : 26.9815386,
    'Si' : 28.0855000,
    'P'  : 30.9737620,
    'S'  : 32.0650000,
    'Cl' : 35.4530000,
    'Ar' : 39.9480000,
    'K'  : 39.0983000,
    'Ca' : 40.0780000,
}

units = {
    "lj": {
        "boltz"      : 1.0,
        "hplanck"    : 1.0,
        "mvv2e"      : 1.0,
        "ftm2v"      : 1.0,
        "mv2d"       : 1.0,
        "nktv2p"     : 1.0,
        "qqr2e"      : 1.0,
        "qe2f"       : 1.0,
        "vxmu2f"     : 1.0,
        "xxt2kmu"    : 1.0,
        "e_mass"     : 0.0,
        "hhmrr2e"    : 0.0,
        "mvh2r"      : 0.0,
        "angstrom"   : 1.0,
        "femtosecond": 1.0,
        "qelectron"  : 1.0,
        "dt"         : 0.005,
        "skin"       : 0.3,
    },
    "real": {
        'boltz'      : 0.0019872067,                    # 玻尔兹曼常数（单位：eV/K）
        'hplanck'    : 95.306976368,                    # 普朗克常数（单位：eV·fs）
        'mvv2e'      : 48.88821291 * 48.88821291,       # 质量和速度平方转化为能量的比例因子
        'ftm2v'      : 1.0 / 48.88821291 / 48.88821291, # 力和时间转化为速度的比例因子
        'mv2d'       : 1.0 / 0.602214129,               #  质量和速度平方转化为温度的比例因子？ d 应该是 dynamic
        'nktv2p'     : 68568.415,                       # 压强单位的转化因子
        'qqr2e'      : 332.06371,                       # 电荷乘积转化为能量的比例因子
        'qe2f'       : 23.060549,                       # 电荷和电场转化为力的比例因子
        'vxmu2f'     : 1.4393264316e4,                  # 速度、摩擦系数和距离的转化因子
        'xxt2kmu'    : 0.1,                             # 应力和时间转化为动力学粘滞度的比例因子
        'e_mass'     : 1.0 / 1836.1527556560675,        # 电子质量相对于质子质量的比例因子
        'hhmrr2e'    : 0.0957018663603261,              # 哈密顿动力学耦合转化为能量的比例因子
        'mvh2r'      : 1.5339009481951,
        'angstrom'   : 1.0,                             # 埃，距离单位
        'femtosecond': 1.0,                             # 飞秒，时间单位
        'qelectron'  : 1.0,
        'eV2kcm'     : 23.061,
        "dt"         : 1.0,
        "skin"       : 2.0,
    },
    "metal": {
        "boltz"      : 8.617343e-5,
        "hplanck"    : 4.135667403e-3,
        "mvv2e"      : 1.0364269e-4,
        "ftm2v"      : 1.0 / 1.0364269e-4,
        "mv2d"       : 1.0 / 0.602214129,
        "nktv2p"     : 1.6021765e6,
        "qqr2e"      : 14.399645,
        "qe2f"       : 1.0,
        "vxmu2f"     : 0.6241509647,
        "xxt2kmu"    : 1.0e-4,
        "e_mass"     : 0.0,
        "hhmrr2e"    : 0.0,
        "mvh2r"      : 0.0,
        "angstrom"   : 1.0,
        "femtosecond": 1.0e-3,
        "qelectron"  : 1.0,
        "dt"         : 0.001,
        "skin"       : 2.0,
    },
    "electron": {
        "boltz"      : 3.16681534e-6,
        "hplanck"    : 0.1519829846,
        "mvv2e"      : 1.06657236,
        "ftm2v"      : 0.937582899,
        "mv2d"       : 1.0,
        "nktv2p"     : 2.94210108e13,
        "qqr2e"      : 1.0,
        "qe2f"       : 1.94469051e-10,
        "vxmu2f"     : 3.39893149e1,
        "xxt2kmu"    : 3.13796367e-2,
        "e_mass"     : 0.0,
        "hhmrr2e"    : 0.0,
        "mvh2r"      : 0.0,
        "angstrom"   : 1.88972612,
        "femtosecond": 1.0,
        "qelectron"  : 1.0,
        "dt"         : 0.001,
        "skin"       : 2.0,
    }
}

try:
    import numpy as np
    atom_mass_array = np.array(atom_mass_array)
except ImportError:
    print("can not import numpy, atom_mass_array do not convert to numpy array")

from .jsonParser import data_parser